# Сценарий адаптации (онбординга) согласно полному ТЗ "Чат-бот Корсик".

ONBOARDING_STAGES = [
    {
        "id": "day_minus_3",
        "name": "За 2-3 дня до выхода",
        "messages": [
            {
                "text": "Добро пожаловать в нашу команду!\nПривет-привет-привет! 🐾 Меня зовут Корсик, ваш персональный гид по миру Группы ПОЛИПЛАСТИК! 🤗\n\nРад знакомству и обещаю сделать вашу адаптацию веселой, легкой и комфортной! 💃 Вместе мы изучим компанию и найдем друзей среди лучших специалистов отрасли. 🌟\n\nГотов делиться секретами успешной интеграции, отвечать на ваши вопросы и помогать адаптироваться в новом коллективе! 👍\n\nДавайте начнем путешествие навстречу большим профессиональным успехам и теплым отношениям! ✨\n\nКорсик",
                "keyboard": None
            },
            {
                "text": "Как мы будем общаться?",
                "keyboard": [
                    [{"type": "callback", "text": "На ТЫ", "payload": "tone_informal"}],
                    [{"type": "callback", "text": "На ВЫ", "payload": "tone_formal"}]
                ]
            },
            {
                "text": "Для того, чтобы ты пришел подготовленный в свой первый рабочий день, ознакомься со списком необходимых для оформления документов и подготовь их к своему выходу на работу:\n1. Трудовая книжка и сведения о трудовой деятельности\n2. Паспорт\n3. СНИЛС\n4. ИНН\n5. Документ об образовании\n6. Свидетельство о браке/разводе\n7. Свидетельство о рождении ребенка\n8. Документы воинского учета\n9. Фотографии 3*4 в количестве 2шт",
                "keyboard": None
            },
            {
                "text": "Чтобы дорога до офиса была комфортнее, у нас есть корпоративный транспорт! Рассказать о маршрутах и расписании?",
                "keyboard": [
                    [{"type": "callback", "text": "Да, расскажи", "payload": "transport_yes"}],
                    [{"type": "callback", "text": "Нет, спасибо", "payload": "transport_no"}]
                ]
            },
            {
                "text": "Я готов поделиться самыми интересными фактами о своей организации.\n\n🧑🏼‍🔧 Факт №1: Я горжусь тем, что работаю в компании, которая делает мир лучше каждый день! Наши инновационные трубы помогают обеспечивать чистой водой миллионы людей по всей стране...\n\n📚 Факт №2: Здесь ценят инициативу и поддерживают таланты! Все сотрудники имеют равные возможности развиваться профессионально и строить карьеру.\n\n🛠️ Факт №3: Группа «ПОЛИПЛАСТИК» имеет филиалы по всей России и странам СНГ, так что твоя карьера может легко превратиться в захватывающее приключение.\n\nПрисоединяйся к нашей большой команде!",
                "keyboard": None
            },
            {
                "text": "Очень скоро мы начнем полноценное погружение в компанию, а пока отдыхай. Я напишу тебе за день до выхода на работу \n\nДо встречи! 👋🏻",
                "keyboard": None
            }
        ]
    },
    {
        "id": "day_minus_1",
        "name": "За день до выхода",
        "messages": [
            {
                "text": "Привет! Уже завтра наступит твой первый рабочий день. Ты готов?",
                "keyboard": [
                    [{"type": "callback", "text": "Да, жду не дождусь!", "payload": "ready_yes"}],
                    [{"type": "callback", "text": "Готов/Готова", "payload": "ready_ok"}],
                    [{"type": "callback", "text": "Да, но немного волнуюсь", "payload": "ready_nervous"}]
                ]
            },
            {
                "text": "Для того, чтобы ты пришел подготовленный в свой первый рабочий день, напоминаю про список необходимых для оформления документов, подготовь их к своему выходу на работу.",
                "keyboard": None
            }
        ]
    },
    {
        "id": "day_1",
        "name": "Первый рабочий день",
        "messages": [
            {
                "text": "Поздравляю с первым рабочим днем! 🥳\n\nУверен, что ты будешь отлично справляться со своими задачами, вносить свой вклад в наше общее дело и делиться идеями. Мы всегда готовы поддержать тебя и создать комфортные условия для работы.",
                "keyboard": None
            },
            {
                "text": "Наш офис довольно большой, но я помогу тебе в нем разобраться! Хочешь я покажу тебе подробную карту?",
                "keyboard": [
                    [{"type": "callback", "text": "Показать карту", "payload": "map_yes"}],
                    [{"type": "callback", "text": "Я уже ориентируюсь", "payload": "map_no"}]
                ]
            },
            {
                "text": "Тебе предстоит многое узнать о нашей компании. Но сначала решим пару организационных вопросов.\n\nНа твоем рабочем месте тебя будет ждать необходимая техника. Для тебя уже заведена учетная запись и доступы IT. Есть ли у тебя все необходимые доступы и материалы?",
                "keyboard": [
                    [{"type": "callback", "text": "Да, все есть", "payload": "access_yes"}],
                    [{"type": "callback", "text": "Нет", "payload": "access_no"}]
                ]
            },
            {
                "text": "Хочешь, подскажу, где пообедать?",
                "keyboard": [
                    [{"type": "callback", "text": "Да!", "payload": "lunch_yes"}],
                    [{"type": "callback", "text": "Нет, спасибо!", "payload": "lunch_no"}]
                ]
            },
            {
                "text": "Первый рабочий день позади!\n\nЭто очень важный момент, первые шаги в новой работе всегда особенные. Я уверен, что ты успешно справился со своими первыми задачами.",
                "keyboard": None
            }
        ]
    },
    {
        "id": "day_3",
        "name": "Третий рабочий день (Опросы)",
        "messages": [
            {
                "text": "Привет! Надеюсь, что ты уже чуть лучше понимаешь нашу компанию, наши ценности и правила. Чтобы полностью влиться в команду, твой руководитель подготовил для тебя адаптационный план.\n\nЕсли у тебя возникнут вопросы или потребуется помощь во время адаптации, не бойся обращаться к своему руководителю.",
                "keyboard": None
            },
            {
                "text": "Первые пару дней на новом месте могут быть немного сложными, поэтому мы предлагаем пройти тебе опрос, чтобы поделиться с нами своими впечатлениями!\n\nВопрос 1: Были ли вопросы при оформлении?",
                "keyboard": [
                    [{"type": "callback", "text": "Все отлично!", "payload": "poll_d3_q1_a"}],
                    [{"type": "callback", "text": "Остались вопросы", "payload": "poll_d3_q1_b"}],
                    [{"type": "callback", "text": "Возникли трудности с документами", "payload": "poll_d3_q1_c"}]
                ]
            }
        ]
    },
    {
        "id": "month_2",
        "name": "Второй месяц работы",
        "messages": [
            {
                "text": "Привет! Поздравляю тебя с успешным завершением месяца работы! Так держать!\n\nПусть каждый новый месяц приносит еще больше возможностей для развития.",
                "keyboard": None
            },
            {
                "text": "Мы придаём большое значение успешной адаптации новых сотрудников. Подскажи, как идет работа по адаптационному плану?",
                "keyboard": [
                    [{"type": "callback", "text": "Все хорошо! Продвигаюсь по плану", "payload": "poll_m2_a"}],
                    [{"type": "callback", "text": "Все ок! Немного отстаю от графика", "payload": "poll_m2_b"}],
                    [{"type": "callback", "text": "Я отстаю от графика.", "payload": "poll_m2_c"}]
                ]
            }
        ]
    },
    {
        "id": "final",
        "name": "Окончание испытательного срока",
        "messages": [
            {
                "text": "Дорогой друг,\nЭти 3 месяца пролетели так быстро! Ты только начинаешь познавать нашу компанию и вот, уже завершился твой адаптационный период...\n\nПока эмоции все еще свежи, поделишься с нами своими впечатлениями от прохождения испытательного срока?",
                "keyboard": None
            },
            {
                "text": "Вопрос 1: Что было самым сложным в период адаптации?",
                "keyboard": [
                    [{"type": "callback", "text": "Со всем справился", "payload": "poll_fin_q1_a"}],
                    [{"type": "callback", "text": "Коммуникации с другими отделами", "payload": "poll_fin_q1_b"}],
                    [{"type": "callback", "text": "Нечеткие задачи", "payload": "poll_fin_q1_c"}]
                ]
            },
            {
                "text": "Вопрос 2: Планируешь ли ты продолжить работу по итогам испытательного срока?",
                "keyboard": [
                    [{"type": "callback", "text": "Да, однозначно!", "payload": "poll_fin_q2_a"}],
                    [{"type": "callback", "text": "Не уверен", "payload": "poll_fin_q2_b"}],
                    [{"type": "callback", "text": "Нет, задумываюсь об уходе", "payload": "poll_fin_q2_c"}]
                ]
            }
        ]
    }
]
